/*
Написано в Kate
Скомпільовано в g++
Містить чотири функції ітераційних методів розв'язку рівнянь:
метод ділення навпіл, метод хорд, метод Ньютона, метод простої ітерації
*/

#include <iostream.h>
#include <cmath>

//ТЕСТОВІ ФУНКЦІЇ

//--------------------------------------------------------------------------------------------------------
//рівняння вигляду f(x)=0, x^2 - 3x - 4 = (x+1)(x-4)

double f1(double x)
{
	return(pow(x,2) - 3*x -4);
}

//--------------------------------------------------------------------------------------------------------
//рівняння вигляду f(x)=0, cos x = 0

double f2(double x)
{
	return(cos(x));
}

//ІТЕРАЦІЙНІ МЕТОДИ

//--------------------------------------------------------------------------------------------------------
//метод ділення відрізку навпіл

double half(double a, double b, double(*y)(double), double e)
{
	double r, l;
	double m, z;
	int i, k;
	
	l = a; r = b;
	z = r - l;
	m = (l + r)*0.5;

	if (y(m)==0)
		{
			return(m);
		}

	for(i=1;z>=e;i++)
	{
		if (y(m)>0) //переписати нахуй, бо хуйню рахує
			{
				(r = m);
			}
		else (l = m);
		cout<<"z="<<z<<"  "<<"m="<<m<<"\n";
		//cin>>k;
		z = r - l;
		m = (l + r)*0.5;
	}
	return(m);
}

//--------------------------------------------------------------------------------------------------------
//метод простої ітерації (працює)

double iter(double x0, double(*y)(double), double s)
{
	double x;
	int i;
	
	x=y(x0);
	for(i=1;i<=s;i++)
	{
		x=(y(x));
	}
	return(x);
}

int main(void)
{
	double a, b, e;
	cout<<"x0:";cin>>a;	
	//cout<<"b:";cin>>b;
	cout<<"e:";cin>>e;
	cout<<"x="<<iter(a, &f2, e)<<"\n";
	return(0);
}
